Repository: jssmk/hhlevents
Catalog: hhlevents/locale/*/LC_MESSAGES/django.po
Languages: fi

source: First name
fi: Etunimi

source: Surname
fi: Sukunimi

source: E-Mail
fi: Sähköposti

source: I want materials package
fi: Haluan materiaalipaketin

source: I want to join as a member
fi: Haluan liittyä jäseneksi

source: Municipality
fi: Kotikunta

source: Form link
fi: Lomakkeen linkki

source: event
fi: tapahtuma

source: events
fi: tapahtumat

source: participant
fi: osallistuja

source: participants
fi: osallistujat

source: registration
fi: ilmoittautuminen

source: Sign up for the event
fi: Ilmoittaudu tapahtumaan

source: Note! There are cancellations in the event
fi: Huom! Tapahtumassa on peruutuksia

source: Note! The event has ended
fi: Huom! Tapahtuma on päättynyt

source: This event does not require pre-registering
fi: Tämä tapahtuma ei vaadi ennakkoilmoittautumista

source: This event does accept further registering
fi: Tähän tapahtumaan ei voi enää ilmoittautua

source: This event is full, but you can sign up for a place in queue. We will let you know if more places become available.
fi: Tämä tapahtuma on täynnä, mutta voit ilmoittautua jonoon. Kerromme, jos paikkoja vapautuu.

source: Mandatory registering information
fi: Pakolliset ilmoittautumistiedot

source: Registering information
fi: Ilmoittautumistiedot

source: Optional information
fi: Vapaaehtoiset tiedot

source: Materials package costs
fi: Materiaalipaketin hinta

source: Django site admin
fi: Djangon ylläpitäjä

source: Event begins
fi: Tapahtuma alkaa

source: Event ends
fi: Tapahtuma päättyy

source: Location
fi: Sijainti

source: Max. allowed participants
fi: Maksimi osallistujamäärä

source: Registrations close
fi: Ilmoittautuminen päättyy

source: Participation fee
fi: Osallistumismaksu

source: Materials fee
fi: Materiaalimaksu

source: Materials mandatory
fi: Materiaalit pakolliset

source: Due date
fi: Eräpäivä

source: Separate form
fi: Erillinen lomake

source: Cancellations
fi: Peruutukset

source: Participants
fi: Osallistujat

source: Send E-mail to all participants (BCC)
fi: Lähetä sähköpostia kaikille osallistujille (BCC)

source: Message
fi: Viesti

source: Send copy of E-mail to address (CC):
fi: Lähetä kopio viestistä osoitteeseen (CC):

source: Replies are asked to send to address (Reply-To):
fi: Viestin vastaukset pyydetään osoitteeseen (Reply-To):

source: Submit
fi: Lähetä

source: Add
fi: Lisää

source: Change
fi: Muuta

source: Tools
fi: Työkalut

source: Event summaries
fi: Tapahtuman yhteenveto

source: You don't have permission to edit anything.
fi: Sinulla ei ole oikeuksia muuttaa mitään

source: Recent Actions
fi: Viimeisimmät tapahtumat

source: My Actions
fi: Tapahtumani

source: None available
fi: Ei saatavilla

source: Unknown content
fi: Tuntematon sisältö

source: clear
fi: tyhjennä
